//@TODO: 걸어온 길
export const experienceData = [
  {
    company: "금오공과대학교 전자공학",
    role: "아이디어 공모전을 즐기는 대학생",
    period: "2018.03 - 2020.12",
    type: "의무경찰 군복역",
    icon: "lightBulb",
    color: "primary",
    summary: "새로운 아이디어 기획 과정을 즐겼습니다. 특히 ICT 기술과 앱 서비스를 혼합한 아이디어를 주로 구상하였습니다.",
    impacts: [
      "18' 금오공대 창업발명 아이디어 경진대회 (장려)",
      "18' 수원시 ICT 아이디어 공모전 (결선)",
      "19' 광주광역시 인공지능 아이디어 공모전 (최우수)",
      "20' 특허청 사회적 아이디어 공모전 (대상)",
    ]
  },
  {
    company: "금오공과대학교 소프트웨어공학",
    role: "Android Developer",
    period: "2021.01 - 2023.06",
    type: "TBU Inc",
    icon: "codeXml",
    color: "accent-cyan",
    summary: "내 아이디어를 실현하고 싶다는 생각으로, 군복학 직후 소프트웨어공학과 앱 개발을 공부했습니다. 1년의 시간을 보내고 Android 개발자로 초기 스타트업에 합류하여 시리즈 A 투자 유치 과정에 기여했습니다.",
    impacts: [
      "앱 안정성 개선 (2개월간 약 7% 감소 및 유지)",
      "소프트웨어 2.0 리팩터링 및 개발시스템 구축",
      "시리즈 A 투자 유치한 주요기능 개발",
      "티맵과 협업하여 Flutter WebAPP 임베드",
      "회사 목표 달성 위해 월평균 200시간 자발적 근무",
      "퇴사 전 업무 가이드 작성 및 인수인계",
    ]
  },
  {
    company: "한국공학대학교 IT경영",
    role: "Startup Founder",
    period: "2024.03 - 2025.12",
    type: "체리픽 창업팀",
    icon: "shipWheel",
    color: "accent-amber",
    summary: "구현뿐만 아니라 비즈니스 임팩트를 창출하고 싶다는 생각으로, IT경영학과에 편입해 다양한 분야를 학습했습니다. 이후 직접 창업팀을 빌딩해 신규 서비스를 기획·디자인·개발·운영했습니다.",
    impacts: [
      "25' 대학 창업유망팀 선정 (교육부)",
      "25' 한이음ICT 창업지원팀 선정 (과기정통부)",
      "25' 첨단기술 창업경진대회 수상 (한국연구재단)",
      "25' 한국공학대전 이사장상 수상 (한국공학대학교)",
      "TIPS 운영 투자사 주관의 시드투자 심사 진행",
      "1천만원대 개발외주 수주-도급-정산 완료",
    ]
  },
  {
    company: "OOO",
    role: "Product Manager",
    period: "2026 -",
    type: "새회사",
    icon: "briefcaseBusiness",
    color: "accent-amber",
    summary: "창업 실패 경험을 통해 더 이상 '내'가 아닌 '고객'이 원하는 아이디어를 실현하고자 합니다. 고객의 행동에서 드러나는 고충, 비즈니스 목표, 기술의 접점에서 최적의 솔루션을 제시하며, 이제는 '돈을 버는 실적'을 쌓아 올리고자 합니다.",
    impacts: [
      "다음 실적을 올리기 위한 조직을 찾고 있습니다."
    ]
  }
];
